/* Copyright © 2001-2012 Apple Inc. All Rights Reserved. */
/* Localization dictionary for Apple Hardware Test 3.0 series */

"is-two-bytes"	= "1";
"version-sig"	= "EN-070918";

"common-controls-restart"		= "Újraindítás";
"common-controls-shutdown"		= "Kikapcsolás";
"common-controls-continue"		= "Folytatás";

"common-tab-apple-title"		= " Infó ";			// does look better with spaces at head and tail
"common-tab-test-title"			= " Hardvertesztek";	// does look better with spaces at head and tail
"common-tab-profile-title"		= " Hardverprofil";	// does look better with spaces at head and tail
"common-version-str"			= "Verzió ";
"common-bundle-str"				= "Csomag ";

"mark-graphics-unknown-str"		= "Ismeretlen videó";
"mark-graphics-none-str"		= " ";

"mark-generic-present-str"		= "Telepítve";
"mark-generic-absent-str"		= "Nem található";
"mark-generic-hasDevice-str"	= "Eszköz csatlakoztatva";
"mark-generic-hasNoDevice-str"	= "Nincs eszköz csatlakoztatva";

"units-hz--short-str"	= "Hz";
"units-hz--long-str"	= "hertz";
"units-byte-short-str"	= "B";
"units-byte-long-str"	= "Bájt";
"units-bit-short-str"	= "b";
"units-bit-long-str"	= "bit";
"units-volt-short-str"	= "V";
"units-volt-long-str"	= "Volt";


"units-hour-str"		= " óra";
"units-hours-str"		= " óra";
"units-min-str"			= " perc ";
"units-mins-str"		= " perc ";
"units-sec-str"			= " s";
"units-secs-str"		= " s ";

"units-kilo-str"		= "K";
"units-mega-str"		= "M";
"units-giga-str"		= "G";
"units-tera-str"		= "T";

"delim-date-str"		= "/";
"delim-at-str"			= " @ ";
"delim-record-str"		= ":";
"delim-field-str"		= ", ";
"delim-item-str"		= "-";
"delim-decimal-str"		= ",";
"delim-thousds-str"		= ", ";
"delim-space-str"		= " ";
"delim-pct-str"			= "%";

"notcompat-nosupport-str"		= "Az Apple Hardware Test nem támogatja ezt a gépet.";
"notcompat-ownrisk-str"			= "Csak saját felelősségére folytassa [csak a kiadás előtti verziónál].";


"test-head-intro1-text"			= "Az Apple Hardware Test teszteli tudja a Macintosh gépe hardverét.";
"test-head-intro2-text"			= "A tesztek végrehajtásához kattintson a „Teszt” gombra, vagy nyomja meg a „T” billentyűt.";

"test-probe-onto-text"			= "Hardver tesztelése; ez eltarthat egy-két percig...";
"test-probe-outof-text"			= "Hardveres vizsgálat befejezve.";

"test-controls-launch"			= "Tesztelés";
"test-controls-interrupt"		= "Tesztelés leállítása";

"test-choices-title"			= "Tesztelési lehetőségek";
"test-about-title"				= "A tesztek és eredmények ismertetése";
"test-results-title"			= "Teszteredmények";

"test-results-notestyet"		= "Nem futtatható teszt, amíg a vizsgálat be nem fejeződött.";
"test-results-nodevfound"		= "Nem találhatók lemezek.";
"test-results-notyet"			= "Tesztelésre kész.";
"test-results-quick-ongoing"	= "Tesztelés folyamatban.";
"test-results-extend-ongoing"	= "Kibővített teszt folyamatban.";
"test-results-willstop"			= "A tesztelés leáll.";
"test-results-interrupted"		= "A tesztelés nem fejeződött be.";
"test-results-nofail"			= "Nem található probléma.";
"test-results-error"			= "Belső hiba a tesztelés közben.";
"test-results-failed"			= "Figyelem! Az Apple Hardware Test hibát észlelt.";

"test-ongoing-short-status"		= "Tesztelés folyamatban.";
"test-ongoing-mlb-status"		= "Alaplap tesztelése.";
"test-ongoing-memory-status"	= "Memória tesztelése.";
"test-ongoing-storage-status"	= "Tárhely tesztelése.";
"test-ongoing-video-status"		= "Grafika tesztelése";

"test-ongoing-pass-time-text"	= " tesztelésbe...";
"test-ongoing-pass-time-1-text"	= " ";
"test-ongoing-pass-time-2-text"	= "tesztelésbe...";
"test-ongoing-sess-pass-text"	= "Folyamat száma:";
"test-ongoing-sess-time-text"	= "Tesztelés teljes ideje:";

"test-desc-initial-1-text"	= "Az Apple Hardware Test egy diagnosztikai eszköz a számítógép hardver-összetevői problémáinak vizsgálatához.";
"test-desc-initial-2-text"	= " ";
"test-desc-initial-3-text"	= "Az elvégzett tesztek segítenek megállapítani, hogy hardverprobléma vagy szoftverprobléma áll fenn.";
"test-desc-initial-4-text"	= " ";
"test-desc-initial-5-text"	= "Ha az eredmények azt mutatják, hogy nincsenek hardverproblémák, akkor további hibakeresési információkért olvassa el a számítógéphez kapott kézikönyvet és/vagy a súgót.";
"test-desc-initial-6-text"	= " ";

"test-desc-intro-quick-text"	= "Befejezés becsült ideje: 3 perc vagy hosszabb, a telepített memória mennyiségétől függően.";	/* default */
"test-desc-intro-quick-text2"	= "Befejezés becsült ideje: 10-15 másodperc vagy hosszabb, a telepített memória mennyiségétől függően.";
"test-desc-intro-quick-text3"	= "Befejezés becsült ideje: 2 perc vagy hosszabb, a telepített memória mennyiségétől függően.";
"test-desc-intro-quick-text4"	= "Befejezés becsült ideje: 4 perc vagy hosszabb, a telepített memória mennyiségétől függően.";

"test-desc-intro-extend-text"	= "Befejezés becsült ideje: 1 óra vagy hosszabb, a telepített memória mennyiségétől függően.";	/* default */
"test-desc-intro-extend-text2"	= "Befejezés becsült ideje: 10-15 perc vagy hosszabb, a telepített memória mennyiségétől függően.";
"test-desc-intro-extend-text3"	= "Befejezés becsült ideje: 30 perc vagy hosszabb, a telepített memória mennyiségétől függően.";
"test-desc-intro-extend-text4"	= "Befejezés becsült ideje: 2 óra vagy hosszabb, a telepített memória mennyiségétől függően.";

"test-desc-option-extend-text"	= "Kibővített teszt végrehajtása (jelentősen több ideig tart).";
"test-desc-option-loop-text"	= "Ciklus engedélyezve.";

"test-desc-quick-running-1-text"	= "Tesztelés folyamatban...";
"test-desc-quick-running-2-text"	= "A leállításhoz kattintson a „Tesztelés leállítása” gombra.";
"test-desc-quick-running-3-text"	= "Vagy nyomja le egyszerre a  “Command” (“Apple”) és a „.” (pont) billentyűt.";
"test-desc-quick-running-4-text"	= " ";

"test-desc-extend-running-1-text"	= "Kibővített teszt folyamatban...";
"test-desc-extend-running-2-text"	= "A leállításhoz kattintson a „Tesztelés leállítása” gombra.";
"test-desc-extend-running-3-text"	= "Vagy nyomja le egyszerre a „Command” („Apple”) és a „.” (pont) billentyűt.";
"test-desc-extend-running-4-text"	= " ";

/* About the Tests and Results Test tests failed */
"test-result-testing-1-text"		= "Figyelem! Az Apple Hardware Test hibát észlelt.";
"test-result-testing-2-text"		= " ";
"test-result-testing-3-text"		= "Először jegyezze fel a Teszteredmények területen megjelenő hibakódot. ";
"test-result-testing-4-text"		= " ";
"test-result-testing-5-text"		= "Másodszor, ha perifériák csatlakoznak a számítógéphez, zárja el a számítógépet, bontsa a perifériákat, és futtassa a Kibővített tesztet az eredmények ellenőrzéséhez.";
"test-result-testing-6-text"		= " ";
"test-result-testing-7-text"		= "Ezután, ha a hiba továbbra is fennáll, tekintse meg a számítógéphez kapott szervizelési és támogatási anyagot, amelyből megtudhatja, hogyan léphet kapcsolatba az AppleCare-rel további segítségnyújtásoz.";
"test-result-testing-8-text"		= " ";

/* About the Tests and Results Test POST failed */
"test-result-startup-1-text"		= "Figyelem! Az Apple Hardware Test hibát észlelt indításkor.";
"test-result-startup-2-text"		= " ";
"test-result-startup-3-text"		= "Először jegyezze fel a Teszteredmények területen megjelenő hibakódokat. ";
"test-result-startup-4-text"		= " ";
"test-result-startup-5-text"		= "Másodszor, ha perifériák csatlakoznak a számítógéphez, zárja el a számítógépet, bontsa a perifériákat, és futtassa a Kibővített tesztet az eredmények ellenőrzéséhez.";
"test-result-startup-6-text"		= " ";
"test-result-startup-7-text"		= "Ezután, ha a hiba továbbra is fennáll, tekintse meg a számítógéphez kapott szervizelési és támogatási anyagot, amelyből megtudhatja, hogyan léphet kapcsolatba az AppleCare-rel további segítségnyújtásoz.";
"test-result-startup-8-text"		= " ";
"test-result-startup-9-text"		= " ";
"test-result-startup-10-text"		= " ";
"test-result-startup-11-text"		= " ";


/* HW-Profile values */

"prof-prod-group-title"			= "Termék";
"prof-prod-group-subtitle"		= "Termék részletei:";
"prof-prod-name-label"			= "Macintosh-név:";
"prof-prod-model-label"			= "Macintosh-modell:";
"prof-prod-cputype-label"		= "Processzotípus:";
"prof-prod-cpucount-label"		= "Processzorok száma:";
"prof-prod-cpucoretotal-label"	= "Magok teljes száma:";
"prof-prod-cpucorecount-label"	= "Magok száma:";
"prof-prod-cpuspeed-label"		= "Processzorsebesség:";
"prof-prod-cpucache-label"		= "L2 processzor-gyorsítótár (processzoronként):";

"prof-prod-L2cache-label"		= "L2 gyorsítótár:";
"prof-prod-L2cachecore-label"	= "L2 gyorsítótár (magonként):";
"prof-prod-L3cache-label"		= "L3 gyorsítótár:";

"prof-prod-cpucache3-label"		= "L3 gyorsítótár (processzoronként):";
"prof-prod-mlb-sn-label"		= "Alaplap sorozatszáma:";
"prof-processor-tray-sn-label"	= "Processzor sorozatszáma:";

"prof-graph-group-title"		= "Videó";
"prof-graph-group-subtitle"		= "Videó részletei:";
"prof-graph-chipset-label"		= "Grafika:";
"prof-graph-vram-label"			= "VRAM:";
"prof-graph-disp-width-label"	= "Kijelző szélessége (képpontban):";
"prof-graph-disp-height-label"	= "Kijelző magassága (képpontban):";

"prof-communi-group-title"		= "Kommunikáció";
"prof-communi-group-subtitle"	= "Kommunikáció részletei:";
"prof-communi-enet-mac-label"	= "Ethernet MAC-cím:";
"prof-communi-fwire-mac-label"	= "FireWire MAC-cím:";
"prof-communi-airp-type-label"	= "AirPort:";
"prof-communi-bluetooth-label"	= "Bluetooth:";
"prof-communi-irport-label"		= "IR-vevő:";
"prof-communi-usb1-connect-label"	= "1. USB-port:";
"prof-communi-usb2-connect-label"	= "2. USB-port:";
"prof-communi-usb3-connect-label"	= "3. USB-port:";
"prof-communi-usb4-connect-label"	= "4. USB-port:";

"prof-memo-group-title"			= "Memória";
"prof-memo-group-subtitle"		= "Memória részletei:";
"prof-memo-overview-label"		= "Áttekintés";
"prof-memo-slot-1-label"		= "1. memória";
"prof-memo-slot-2-label"		= "2. memória";
"prof-memo-slot-3-label"		= "3. memória";
"prof-memo-slot-4-label"		= "4. memória";
"prof-memo-slot-5-label"		= "5. memória";
"prof-memo-slot-6-label"		= "6. memória";
"prof-memo-slot-7-label"		= "7. memória";
"prof-memo-slot-8-label"		= "8. memória";

"prof-memo-type-str"			= "Alaplapra forrasztott SDRAM.";
"prof-memo--str"				= "Ismeretlen";
"prof-memo-pc2-3700-str"		= "PC2-3700";
"prof-memo-pc2-4000-str"		= "PC2-4000";
"prof-memo-pc2-4200-str"		= "PC2-4200";
"prof-memo-pc2-4800-str"		= "PC2-4800";
"prof-memo-ddr2-str"			= "DDR2 SDRAM";
"prof-memo-fbdimm-str"			= "FBDIMM";
"prof-memo-cl-str"				= "CL";
"prof-memo-ct1-str"				= " Ciklus ideje (ns)";
"prof-memo-ct2-str"				= "Ciklus (ns)";
"prof-memo-ct3-str"				= " (ns)";
"prof-memo-rev-str"				= "Rev.";
"prof-memo-paired-str"			= "Párosítva a következővel:";
"prof-memo-paired-not-str"		= " nincs párosítva";
"prof-memo-mismatch-label"		= "Eltérés:";
"prof-memo-size-str"			= " méret";
"prof-memo-speed-str"			= " sebesség";
"prof-memo-vendor-str"			= " forgalmazó";
"prof-memo-recommend-str"		= "Javasolt: ";
"prof-memo-post-fail-str"		= "POST-hiba";

"prof-board-group-title"		= "Alaplap";
"prof-board-brom-vers-label"	= "Boot-ROM verziója";
"prof-board-smc-vers-label"		= "SMC-verzió:";
"prof-board-syst-sn-label"		= "Rendszer sorozatszáma:";
"prof-board-bootdev-label"		= "Alapértelmezett rendszerindító eszköz:";

"prof-stor-group-title"			= "Tároló";
"prof-stor-size-label"			= "Méret:";

"prof-powr-group-title"			= "Teljesítmény";
"prof-powr-group-subtitle"		= "Tápellátás részletei:";
"prof-powr-src-label"			= "Energiaforrás:";
"prof-powr-src-wall-str"		= "Adapter";
"prof-powr-src-batt-str"		= "Akkumulátor";
"prof-powr-ac-on-str"			= "Kapcsolódva";
"prof-powr-ac-off-str"			= "Nem kapcsolódik";
"prof-powr-capac-label"			= "Kapacitás:";
"prof-powr-volt-label"			= "Feszültség:";
"prof-powr-status-label"		= "Állapot:";

